{
  "school_info": {
    "cds_code": "123456789",
    "school_name": "Animo Inglewood Charter High",
    "county": "Los Angeles",
    "district": "Green Dot Public Schools",
    "email": "info@greendot.org",
    "domain": "www.greendot.org",
    "website": "https://www.greendot.org"
  },
  "pages": {
    "https://www.greendot.org": {
      "title": "Home - Green Dot",
      "description": "Green Dot Public Schools is a public charter school organization with 18 schools serving 10,000 students in grades 6-12 across Los Angeles.",
      "text_content": "Enroll Now Donate English Español English Español About About Us Commitment to Equity Our Board Our Leadership Strategic Plan Schools Find a School Middle Schools High Schools 7-Year-Pathways Careers Career at Green Dot Teach at Green Dot Lead at Green Dot Credentials Teacher Credentials Clear Admin Credentials Central Office Support Support News Enroll Enroll With Us Careers Work With Us Donate Support Us 25 Years of Transforming Public Education For 25 years, Green Dot Public Schools has been a driving force in reimagining what public education can be—anchored in the belief that every student deserves access to a high-quality education and a future filled with possibility. From our first school to the thriving network we are today, we’ve remained committed to ensuring that all students—regardless of background or zip code—graduate ready for college, leadership, and life. Through innovative teaching, personalized learning, and unwavering belief in our students’ potential, we’ve helped shape a generation of changemakers.As we celebrate this milestone, we invite you to reflect on our journey, honor the communities that fuel our mission, and imagine what the next 25 years can bring. Celebrate 25 Years With Us 25 Years Of Impact Free Public Charter Schools: Grades 6-12 Green Dot Public Schools is a public charter school organization with 18 high-performing schools serving 10,000 students in grades 6-12 across Los Angeles. Our mission is to help transform public education, so all students graduate prepared for college, leadership, and life. Learn More Green Dot by the Numbers 10000 Over 10,000 scholars enrolled 18 Operating 18 schools 74 Our college-ready graduation rate is 22 percentage points higher than the state average 90 More than 90% of parents recommend Green Dot to a friend 92 92% of Green Dot’s class of 2023 received college acceptance letters Explore and Experience Our Green Dot Community of Schools Middle School Middle School High School Ánimo Compton Charter School Ánimo Ellen Ochoa Charter Middle School Ánimo Florence-Firestone Charter Middle School Ánimo James B. Taylor Charter Middle School Ánimo Jefferson Charter Middle School Ánimo Legacy Charter Middle School Ánimo Mae Jemison Charter Middle School Ánimo Compton Charter School Ánimo City of Champions Charter High School Ánimo Inglewood Charter High School Ánimo Jackie Robinson Charter High School Ánimo Leadership Charter High School Ánimo Pat Brown Charter High School Ánimo RalphBunche Charter High School Ánimo South Los Angeles Charter High School Ánimo Venice Charter High School Ánimo Watts Charter High School Alain Leroy Locke College Preparatory Academy Oscar De La Hoya Ánimo Charter High School I am looking for a In Radius: Km Category Sub-Categories Grade Loading... Number Of Shops: 0 PRINT × Store Direction GET DIRECTIONS × From: To: Km Miles GET DIRECTIONS Use my location to find the closest Service Provider near me × USE LOCATION Description × What’s Happening at Green Dot View All News Spoken Word: ‘Perfect or Problematic’ by Jay’Onna Moore Art: ‘The Victim’ by Brandon Linares Writing: ‘A Plea from the Future’ by Belinda Ramos Writing: ‘The Dangers of Technology’ by Abril Alvarez Spoken Word: ‘Scroll Swipe Click to Freedom’ by Esmeralda Benitez Art: ‘The Electronic Crucifixion’ by Kimberly Rojas View All News Events View All Events There is no Event View All Events Stay Connected Powered by Curator.io Honors, Awards, and Recognitions At Green Dot Public Schools, we’re committed to providing all students with a high-quality education that prepares them for success in college and beyond. Our schools have been recognized for academic growth and excellence by the California Department of Education, CORE Districts, and U.S. News & World Report. We’ve also been honored among California Distinguished Schools and CREDO. Join Our Newsletter Join our quartlery newsletter and we’ll keep you in the loop about all of our latest news, programs, and ways to get involved. Email Address: Sign Up Facebook-f Instagram X-twitter Linkedin-in 1149 S. Hill St, Ste. 600 Los Angeles, CA 90015 (323) 565-1600 info@greendot.org . Enroll Now Careers Donate Quick Links Finance and Budget Board Meetings Student Policy Manual Employee Resources Procurement Compliance Immigration Resources About Us Our Students Our Teachers Our Board Terms and Conditions © 2025 Green Dot Public Schools About About Us Commitment to Equity Our Board Our Leadership Strategic Plan Schools Find a School Middle Schools High Schools 7-Year-Pathways Careers Career at Green Dot Teach at Green Dot Lead at Green Dot Credentials Teacher Credentials Clear Admin Credentials Central Office Support Support News We are pleased to announce that all Green Dot campuses have reopened. Our teams have worked hard to ensure a safe and clean environment for your children. Masks will be available for students and staff who need them, but we ask that you send your student to school with a mask if you have ma",
      "status_code": 200,
      "response_size": 240613,
      "links_found": 16,
      "page_type": "home",
      "scraped_at": "2025-10-02T16:42:03.533644"
    },
    "https://www.greendot.org/enroll/": {
      "title": "Enroll - Green Dot",
      "description": "Find out why you should enroll your child in a Green Dot charter school and get started on the application process today!",
      "text_content": "Enroll Now Donate English Español English Español About About Us Commitment to Equity Our Board Our Leadership Strategic Plan Schools Find a School Middle Schools High Schools 7-Year-Pathways Careers Career at Green Dot Teach at Green Dot Lead at Green Dot Credentials Teacher Credentials Clear Admin Credentials Central Office Support Support News Apply Now Find a School FAQs Why Choose Green Dot Public Schools Green Dot Public Schools provides educational enrichment opportunities for future changemakers. We offer high-quality teachers, a nurturing environment, and a supportive college-bound culture. Enroll your young scholar today! Free 6 - 12 Charter Public Schools Free, Healthy Breakfast & Lunch Daily Social-Emotional Wellness & Whole Student Growth Safe, Supportive Environment Extracurricular in Academics, Arts, & Athletics Highly Skilled Teachers & Leaders Learn Our Values Application Process We’re excited to welcome you to one of our schools! Enrolling in one of our middle or high schools simply requires completing a lottery application. To obtain a paper version of the form, please contact us via email or call us at (323) 565-1600. You can also contact the school of your choice directly. Find a School Apply Now Apply Apply Create an account using your phone number or email. Fill out your parent/guardian information and student profile. Select a Green Dot school. Application Submit Submit Once you select a school, you can submit your application.. You will receive an email or text message confirming your successful application submission. Enroll Enroll A Green Dot school representative will guide you through the enrollment process. Green Dot admits students in grades 6-12 through a public, random drawing. Enrollment FAQs App Process Lottery Current Students Miscellaneous What’s the process to enroll? To enroll, parents or guardians must submit an interest form through SchoolMint at https://greendotpublicschools.schoolmint.net to their school of choice. One interest form cannot be used for multiple children. If a school receives a number of interest forms that exceeds its capacity, a lottery will be held in December, depending on each school’s date and time slots. Green Dot does not have any admissions requirements and our schools accept students regardless of prior academic record, conduct, or socioeconomic background. To learn more about enrolling your child in our schools, visit our school websites or contact the school. What documents do I need? If a student is offered a seat, their parent or guardian must accept the offer before the specified deadline. Once the parent or guardian accepts the offer, they must complete the online registration form or request a hard copy from the school. Documents that are required for this process include:Birth CertificateImmunization Records (must be most recent immunization)Proof of AddressProof of Parent or Guardian Identification Can I apply to multiple schools? Yes, you can apply to several schools by filling out the interest form. What are the steps to apply? Submit an interest form online at https://greendotpublicschools.schoolmint.net or mail in a hard copy interest form. If your student is offered a seat, you will need to complete an enrollment packet online at https://greendotpublicschools.schoolmint.net. When is the deadline to apply for the 2024-25 school year? Applications must be received by [date] to be included in the lottery. Applications received after [date] will be placed on the waitlist in the order in which they were received. Our lottery for the 2024-25 school year will take place on Wednesday, December 6th – Tuesday December 12th. When do I find out if my student was accepted? Each school holds its own lottery. Parents or guardians may attend the lottery, but it’s not mandatory. If you cannot attend the lottery, you will be notified of your child’s admittance status shortly after the lottery via mail. Parents or guardians can also log onto SchoolMint to see if their child has been offered a seat or placed on a waitlist. When does the lottery take place? Each school holds its own lottery in December. Parents may attend the lottery. If you cannot attend, you will be notified of your child’s admittance status shortly after the lottery via mail. What is the lottery? Each year, if a school receives more applications than they can accommodate, a random, public lottery will be held, as required by charter law. How does the waitlist work? The number of available spaces varies by school and grade. Hosting a lottery ensures that each student has an equal opportunity to be accepted. Once all available seats have been filled, the lottery will continue to generate a waitlist. All remaining students are placed on the waitlist in the order their names were drawn. If space becomes available, students from the waitlist may be admitted. How will I be notified if my child is selected? All parents will be notified of their student’s acceptance status or number on",
      "status_code": 200,
      "response_size": 225819,
      "links_found": 14,
      "page_type": "internal",
      "scraped_at": "2025-10-02T16:42:04.240178"
    },
    "https://www.greendot.org/calendar-of-events/": {
      "title": "Calendar of Events - Green Dot",
      "description": "View Green Dot Public Schools' calendar of events to stay up to date with what's happening in your student's academic community!",
      "text_content": "Enroll Now Donate English Español English Español About About Us Commitment to Equity Our Board Our Leadership Strategic Plan Schools Find a School Middle Schools High Schools 7-Year-Pathways Careers Career at Green Dot Teach at Green Dot Lead at Green Dot Credentials Teacher Credentials Clear Admin Credentials Central Office Support Support News Calendar of Events There is no Event Facebook-f Instagram X-twitter Linkedin-in 1149 S. Hill St, Ste. 600 Los Angeles, CA 90015 (323) 565-1600 info@greendot.org . Enroll Now Careers Donate Quick Links Finance and Budget Board Meetings Student Policy Manual Employee Resources Procurement Compliance Immigration Resources About Us Our Students Our Teachers Our Board Terms and Conditions © 2025 Green Dot Public Schools About About Us Commitment to Equity Our Board Our Leadership Strategic Plan Schools Find a School Middle Schools High Schools 7-Year-Pathways Careers Career at Green Dot Teach at Green Dot Lead at Green Dot Credentials Teacher Credentials Clear Admin Credentials Central Office Support Support News We are pleased to announce that all Green Dot campuses have reopened. Our teams have worked hard to ensure a safe and clean environment for your children. Masks will be available for students and staff who need them, but we ask that you send your student to school with a mask if you have masks at home.For a detailed update, read our full blog post. In compliance with the California Consumer Privacy Act (CCPA), you have the right to know what personal data we collect, request its deletion, and opt-out of its sale. We ensure reasonable security measures to protect your data and provide a “Do Not Sell My Personal Information” link on our homepage. For more information or to exercise your rights, please contact us at info@greendot.org. OK",
      "status_code": 200,
      "response_size": 91019,
      "links_found": 13,
      "page_type": "internal",
      "scraped_at": "2025-10-02T16:42:05.662361"
    }
  }
}