{"url": "https://www.greendot.org", "status_code": 200, "response_size": 240613, "title": "Home - Green Dot", "description": "Green Dot Public Schools is a public charter school organization with 18 schools serving 10,000 students in grades 6-12 across Los Angeles.", "text_content": "Enroll Now Donate English Español English Español About About Us Commitment to Equity Our Board Our Leadership Strategic Plan Schools Find a School Middle Schools High Schools 7-Year-Pathways Careers Career at Green Dot Teach at Green Dot Lead at Green Dot Credentials Teacher Credentials Clear Admin Credentials Central Office Support Support News Enroll Enroll With Us Careers Work With Us Donate Support Us 25 Years of Transforming Public Education For 25 years, Green Dot Public Schools has been a driving force in reimagining what public education can be—anchored in the belief that every student deserves access to a high-quality education and a future filled with possibility. From our first school to the thriving network we are today, we’ve remained committed to ensuring that all students—regardless of background or zip code—graduate ready for college, leadership, and life. Through innovative teaching, personalized learning, and unwavering belief in our students’ potential, we’ve helped shape a generation of changemakers.As we celebrate this milestone, we invite you to reflect on our journey, honor the communities that fuel our mission, and imagine what the next 25 years can bring. Celebrate 25 Years With Us 25 Years Of Impact Free Public Charter Schools: Grades 6-12 Green Dot Public Schools is a public charter school organization with 18 high-performing schools serving 10,000 students in grades 6-12 across Los Angeles. Our mission is to help transform public education, so all students graduate prepared for college, leadership, and life. Learn More Green Dot by the Numbers 10000 Over 10,000 scholars enrolled 18 Operating 18 schools 74 Our college-ready graduation rate is 22 percentage points higher than the state average 90 More than 90% of parents recommend Green Dot to a friend 92 92% of Green Dot’s class of 2023 received college acceptance letters Explore and Experience Our Green Dot Community of Schools Middle School Middle School High School Ánimo Compton Charter School Ánimo Ellen Ochoa Charter Middle School Ánimo Florence-Firestone Charter Middle School Ánimo James B. Taylor Charter Middle School Ánimo Jefferson Charter Middle School Ánimo Legacy Charter Middle School Ánimo Mae Jemison Charter Middle School Ánimo Compton Charter School Ánimo City of Champions Charter High School Ánimo Inglewood Charter High School Ánimo Jackie Robinson Charter High School Ánimo Leadership Charter High School Ánimo Pat Brown Charter High School Ánimo RalphBunche Charter High School Ánimo South Los Angeles Charter High School Ánimo Venice Charter High School Ánimo Watts Charter High School Alain Leroy Locke College Preparatory Academy Oscar De La Hoya Ánimo Charter High School I am looking for a In Radius: Km Category Sub-Categories Grade Loading... Number Of Shops: 0 PRINT × Store Direction GET DIRECTIONS × From: To: Km Miles GET DIRECTIONS Use my location to find the closest Service Provider near me × USE LOCATION Description × What’s Happening at Green Dot View All News Spoken Word: ‘Perfect or Problematic’ by Jay’Onna Moore Art: ‘The Victim’ by Brandon Linares Writing: ‘A Plea from the Future’ by Belinda Ramos Writing: ‘The Dangers of Technology’ by Abril Alvarez Spoken Word: ‘Scroll Swipe Click to Freedom’ by Esmeralda Benitez Art: ‘The Electronic Crucifixion’ by Kimberly Rojas View All News Events View All Events There is no Event View All Events Stay Connected Powered by Curator.io Honors, Awards, and Recognitions At Green Dot Public Schools, we’re committed to providing all students with a high-quality education that prepares them for success in college and beyond. Our schools have been recognized for academic growth and excellence by the California Department of Education, CORE Districts, and U.S. News & World Report. We’ve also been honored among California Distinguished Schools and CREDO. Join Our Newsletter Join our quartlery newsletter and we’ll keep you in the loop about all of our latest news, programs, and ways to get involved. Email Address: Sign Up Facebook-f Instagram X-twitter Linkedin-in 1149 S. Hill St, Ste. 600 Los Angeles, CA 90015 (323) 565-1600 info@greendot.org . Enroll Now Careers Donate Quick Links Finance and Budget Board Meetings Student Policy Manual Employee Resources Procurement Compliance Immigration Resources About Us Our Students Our Teachers Our Board Terms and Conditions © 2025 Green Dot Public Schools About About Us Commitment to Equity Our Board Our Leadership Strategic Plan Schools Find a School Middle Schools High Schools 7-Year-Pathways Careers Career at Green Dot Teach at Green Dot Lead at Green Dot Credentials Teacher Credentials Clear Admin Credentials Central Office Support Support News We are pleased to announce that all Green Dot campuses have reopened. Our teams have worked hard to ensure a safe and clean environment for your children. Masks will be available for students and staff who need them, but we ask that you send your student to school with a mask if you have ma", "links_found": 16, "scraped_at": "2025-10-02T16:19:23.173859", "cds_code": "123456789", "school_name": "Animo Inglewood Charter High", "county": "Los Angeles", "district": "Green Dot Public Schools", "email": "info@greendot.org", "domain": "www.greendot.org", "website": "https://www.greendot.org", "page_type": "home"}
{"url": "https://www.greendot.org/compliance/", "status_code": 200, "response_size": 121430, "title": "Compliance - Green Dot", "description": "Learn more about the compliance requirements Green Dot Public Schools follows, which protect your students, according to state law.", "text_content": "Enroll Now Donate English Español English Español About About Us Commitment to Equity Our Board Our Leadership Strategic Plan Schools Find a School Middle Schools High Schools 7-Year-Pathways Careers Career at Green Dot Teach at Green Dot Lead at Green Dot Credentials Teacher Credentials Clear Admin Credentials Central Office Support Support News Resources Accountability & School GovernanceFamily ResourcesPoliciesPublic Funding & Transperancy Accountability & School Governance Nondiscrimination Statement: Prohibited–Encouraging Disenrollment Discouraging Enrollment Title IX Policy Title IX, Harassment, Intimidation, Discrimination and Bullying Green Dot Public Schools Board Members Finance & Budget (Form 990, Annual Audit, EPA Report) Green Dot California Board Meetings Education Protection Accounts (EPA) Prop 28 Annual Report CDE Resources for Families Suicide Prevention Policy Request for Proposals Local School Wellness Policy Charter Petitions Nondiscrimination Statement: Prohibited–Encouraging Disenrollment Discouraging Enrollment Nondiscrimination Statement: Prohibited–Encouraging Disenrollment Discouraging EnrollmentGreen Dot Public Schools does not discriminate against any person on the basis of the characteristics listed in Education Code Section 220 (actual or perceived disability, gender, gender identity, gender expression, nationality, race or ethnicity, religion, religious affiliation, sexual orientation, immigration status, or any other characteristic that is contained in the definition of hate crimes set forth in Section 422.55 of the Penal Code or association with an individual who has any of the aforementioned characteristics) and Education Code Sections 221.5 and 221.51 in any of its policies, practices, or procedures. Green Dot Public Schools also does not discriminate against any person on the basis of legal or economic status, primary language, or English Learner status in any of its policies, practices, or procedures. Green Dot Public Schools adheres to all provisions of federal law related to students with disabilities, including but not limited to, Section 504 of the Rehabilitation Act of 1973, Title II of the Americans with Disabilities Act of 1990, and the Individuals with Disabilities Education Improvement Act of 2004 (“IDEA”). Green Dot Public Schools is committed to providing a work and educational atmosphere that is free of unlawful harassment and the “Discrimination/Harassment Policy” complies with the requirements of Titles IV, VI and VII of the Civil Rights Act of 1964 (race, color, or national origin), Title IX of the Educational Amendments of 1972 (sex), Section 504 of the Rehabilitation Act of 1973 (mental or physical disability), The Individuals With Disabilities Education Act of 1990, the Age Discrimination in Employment Act of 1967, and the Age Discrimination Act of 1975, and other applicable federal and state laws. Green Dot Public Schools also prohibits sexual harassment, including cyber sexual bullying, and harassment based upon pregnancy, childbirth or related medical conditions, race, religion, religious affiliation, creed, color, gender, gender identity, gender expression, national origin or ancestry, physical or mental disability, medical condition, marital status, age, sexual orientation, or any other basis protected by federal, state, local law, ordinance or regulation. Green Dot Public Schools does not condone or tolerate harassment of any type, including discrimination, intimidation, or bullying, including cyber sexual bullying, by any employee, independent contractor or other person with which Green Dot Public Schools does business, or any other individual, student, or volunteer. This applies to all employees, students, or volunteers and relationships, regardless of position or gender. Green Dot Public Schools will promptly and thoroughly investigate any complaint of harassment and take appropriate corrective action, if warranted. Inquiries, complaints, or grievances regarding harassment as described in this policy should be directed to the Green Dot Public Schools Uniform Complaint Procedures (“UCP”) Compliance Officer as identified in Policy C. 16.0.Rev. 06/2021 Title IX Policy Title IX PolicyFor details click here. Title IX, Harassment, Intimidation, Discrimination and Bullying Title IX, Harassment, Intimidation, Discrimination and BullyingFor details click here. Green Dot Public Schools Board Members Green Dot Public Schools Board MembersKevin S. Reed – Board ChairVice President and General Counsel, University of OregonKevin Reed is the Vice President and General Counsel for the University of Oregon, and was formerly the Vice Chancellor of Legal Affairs at UCLA. A civil rights lawyer by training, Reed served as general counsel of the Los Angeles Unified School District (LAUSD), the nation’s second largest school district. Prior to joining LAUSD, Reed spent six years as a managing attorney for the western regional office of the NAACP Legal Defense and Edu", "links_found": 12, "scraped_at": "2025-10-02T16:19:25.850222", "cds_code": "123456789", "school_name": "Animo Inglewood Charter High", "county": "Los Angeles", "district": "Green Dot Public Schools", "email": "info@greendot.org", "domain": "www.greendot.org", "website": "https://www.greendot.org", "page_type": "internal"}
{"url": "https://www.greendot.org/news/", "status_code": 200, "response_size": 148769, "title": "News - Green Dot", "description": "Keep up with the latest news and happenings at Green Dot, so you can always be aware of what's going on in your child's academic community!", "text_content": "Enroll Now Donate English Español English Español About About Us Commitment to Equity Our Board Our Leadership Strategic Plan Schools Find a School Middle Schools High Schools 7-Year-Pathways Careers Career at Green Dot Teach at Green Dot Lead at Green Dot Credentials Teacher Credentials Clear Admin Credentials Central Office Support Support News What's Happening at Green Dot Student Stories Empowered Educators Our Community Green Dot In The News May 1, 2025 Spoken Word: ‘Perfect or Problematic’ by Jay’Onna Moore Perfect or Problematic How are we ever gonna flourishwhen AI is taking over jobsThey’re becoming… Read More May 1, 2025 Art: ‘The Victim’ by Brandon Linares Brandon Linares The Victim3rd PLACE ARTMixed Media12th Grade, Ánimo WattsGuiding Teacher: Jesus Martinez Brandon Linares: Artist… Read More May 1, 2025 Writing: ‘A Plea from the Future’ by Belinda Ramos As I write this warning from 2036, my world lies in ruins. Families once secure… Read More May 1, 2025 Writing: ‘The Dangers of Technology’ by Abril Alvarez The Dangers of Technology I was a kid; I was raised with technology, the internet,… Read More May 1, 2025 Spoken Word: ‘Scroll Swipe Click to Freedom’ by Esmeralda Benitez Scroll Swipe Click to Freedom 11th Grade, Ánimo Jackie RobinsonGuiding Teacher: Rachel Kopera Pixels! Bright… Read More May 1, 2025 Art: ‘The Electronic Crucifixion’ by Kimberly Rojas KIMBERLY ROJASThe Electronic Crucifixion2nd PLACE ART (TIE)Mixed Media Installation11th Grade, Ánimo Jackie RobinsonGuiding Teacher: Rachel… Read More May 1, 2025 Art: ‘Iridescent Exit’ by Jessica Miguel Mateo JESSICA MIGUEL MATEOIridescent Exit2nd PLACE ART (TIE)Mixed Media Installation12th Grade, ÁnimoJackie RobinsonGuiding Teacher: Rachel Kopera… Read More May 1, 2025 Writing: ‘The World Between Us’ by Manrique Ariel Saravia MANRIQUE ARIEL SARAVIA 2ND PLACE HIGH SCHOOL The World Between Us “Issue. Verification Failed. Entrance… Read More May 1, 2025 Writing: ‘What Would We Be?’ by Ashly Barrera ASHLY BARRERA – 2nd PLACE MIDDLE SCHOOL What Would We Be?7th Grade, Ánimo Mae JemisonGuiding… Read More May 1, 2025 Spoken Word: ‘Technology’s Gift is a Curse: A Message to My Mother’ by Marisa Rios MARISA RIOS – 1st PLACE SPOKEN WORD Technology’s Gift is a Curse: A Message to… Read More April 28, 2025 Writing: ‘The Price of Progress’ by Jacquelyn Lezama JACQUELYN LEZAMA1st PLACE HIGH SCHOOL The Price of Progress I did not fear them, not… Read More April 28, 2025 Art: ‘Metal and Flesh’ by Daniela Leyva 🏆 1st Place – Art CompetitionTitle: Metal and FleshArtist: Daniela LeyvaGrade: 12th GradeSchool: Ánimo Ralph… Read More April 7, 2025 Writing: ‘The Last Toymaker’ by Jayden Lemus “The Last Toymaker” 8th Grade, Ánimo Florence-Firestone The Last Toymaker Sweat dripped down John’s forehead.… Read More January 29, 2025 Supporting Our Immigrant Community At Green Dot Public Schools, we are committed to creating a safe and inclusive environment… Read More January 14, 2025 A Successful Day Back and Ongoing Updates Dear Green Dot Families, We are thrilled to share that we had a great day… Read More January 13, 2025 Updates on School Reopening Tomorrow Dear Green Dot Families, We hope this message finds you safe as our city continues… Read More January 11, 2025 Standing Together for Our Scholars and Communities and Updates for Next Week Dear Green Dot Families, This past week has been deeply challenging for our city. The… Read More December 9, 2024 The Growing Trend of School Phone Bans in LA: A Move Towards Increased Connection and Creativity As students across Los Angeles return to school this year, a growing number of schools… Read More September 3, 2024 Life Lessons: Comedian/Teacher Puts Community Service First Bryan Ross could be called an “inspiration.” The Watts-born, Compton-raised comedian spends his days teaching… Read More September 3, 2024 Knock Out: Here Are Six Star Boxers Engaged in Philanthropy In 2023, the top 50 highest-earning athletes earned about $3.44 billion over the previous 12… Read More 1 2 3 … 35 Press Contact Maxwell KangkoloDirector of Communications & Marketing maxwell.kangkolo@greendot.org 213-518-8212 Download our Media Kit Video Resources Facebook-f Instagram X-twitter Linkedin-in 1149 S. Hill St, Ste. 600 Los Angeles, CA 90015 (323) 565-1600 info@greendot.org . Enroll Now Careers Donate Quick Links Finance and Budget Board Meetings Student Policy Manual Employee Resources Procurement Compliance Immigration Resources About Us Our Students Our Teachers Our Board Terms and Conditions © 2025 Green Dot Public Schools About About Us Commitment to Equity Our Board Our Leadership Strategic Plan Schools Find a School Middle Schools High Schools 7-Year-Pathways Careers Career at Green Dot Teach at Green Dot Lead at Green Dot Credentials Teacher Credentials Clear Admin Credentials Central Office Support Support News We are pleased to announce that all Green Dot campuses have reopened. Our teams have worked hard to ensure a safe and clea", "links_found": 12, "scraped_at": "2025-10-02T16:19:28.471267", "cds_code": "123456789", "school_name": "Animo Inglewood Charter High", "county": "Los Angeles", "district": "Green Dot Public Schools", "email": "info@greendot.org", "domain": "www.greendot.org", "website": "https://www.greendot.org", "page_type": "internal"}
{"url": "https://www.greendot.org/support/", "status_code": 200, "response_size": 172496, "title": "Support - Green Dot", "description": "Do you want to help transform public education? Donate to Green Dot. Together, we can close opportunity gaps for our young scholars.", "text_content": "Enroll Now Donate English Español English Español About About Us Commitment to Equity Our Board Our Leadership Strategic Plan Schools Find a School Middle Schools High Schools 7-Year-Pathways Careers Career at Green Dot Teach at Green Dot Lead at Green Dot Credentials Teacher Credentials Clear Admin Credentials Central Office Support Support News Change the Odds for Students Green Dot’s schools are located in communities with the highest need in Los Angeles. Our schools are small, supportive environments that prioritize the needs of all students. The work we do is guided by an unwavering belief in the potential of every student to graduate prepared for college, leadership, and life. Donate All Means All Green Dot meets students where they are and prioritizes those furthest from opportunities – students from socioeconomically challenged communities, newcomers, English second language learners, students experiencing homelessness, and foster youth. Donate Now 100% Commitment to Equity Our commitment to equity is exemplified by our efforts to ensure every student has access to rigorous academic programs, regardless of background or circumstance. 100% Entrepreneurial Spirit We cultivate an entrepreneurial spirit among our students and staff, empowering them to innovate and pursue their passions. 100% Belief in Students Green Dot’s students are exceptional and thrive in an environment with care, support, and unlimited expectations. Our Impact In the 21st Century, a college degree is the primary lever for intergenerational social mobility. Today, 23,000 scholars have graduated from Green Dot schools and are prepared for success in college, leadership, and life. Read our Impact Report to learn more. 72 Green Dot Students Enrolled in College 14000 Green Dot Students Enrolled in College Ways To Give Make A Donation Donate online or by check. Connect with a team member today to learn more. Fundraising Page Start Your own fundraising page (Click in and there are step by step directions, programs to support, and ideas of how to market around your page) Become an Ambassador Join a professional and philanthropic network focused on building an excellent public education system for all children.Find out more here. In-kind Donations Donate new or gently used professional attire, dressshoes, accessories, hygiene items, and more Matching Giving Make an impact through your company’s workplace giving program. Check with your employer to learn how you may be able to double, or even triple, the impact of your gift! Volunteer Directly support individuals on their journey to employment. Help pave the way to their long-term success in the job market. Donate Stock Support Green Dot Public Schools with a tax-advantaged stock gift in minutes! Learn more Donate today to CHANGE THE ODDS. Contributions made on this site provide direct support to Green Dot scholars.You can donate online or via check. To donate via check, Please send to:Green Dot Public Schools CaliforniaDevelopment Department1149 S Hill St #600Los Angeles, CA 90015 Our Work Make an impact through your company’s workplace giving program. Check with your employer to learn how you may be able to double, or even triple the impact of your gift! Growth Innovate on our core academic program to accelerate learning & meet individual student needs. Ensure every student is high school and college-ready by the time they graduate. School Uniforms School uniforms play a big role in our schools. They keep students focused on education by removing “what to wear” anxiety, decrease bullying and increase safety. Uniforms enhance school pride and community. College Persistence Green Dot has reimagined the scope of a high school’s responsibility, building a centralized Counseling and College Persistence team that identifies and invests in powerful levers to support students to and through college. Green Dot focuses efforts within three stages of the journey: In School; Over the Summer (between high school and college); and Freshman Year. Model Flex College Readiness and 7 Advanced Placement courses. Opportunity Fund The Opportunity Fund was founded to subsidize college-related “hidden costs” that would otherwise impede Green Dot seniors and current college students from attending or remaining enrolled in a competitive 4-year college with high likelihood of degree attainment. Animo Voices Writing and Art Competition Ánimo Voices supplements our core instructional program by helping to provide our students with an audience and purpose for writing that goes well beyond the four walls of their classroom and core instruction. Foster Youth Support 5% of Green Dot students experience homelessness. That’s 2.5x the rate of LAUSD. In addition to learning, school may be the only place students are receiving case management, mental health support, and nutrition. College and Career Pathways Green Dot schools offer a variety of opportunities for students to earn college credit and to train in competitive car", "links_found": 12, "scraped_at": "2025-10-02T16:19:30.741290", "cds_code": "123456789", "school_name": "Animo Inglewood Charter High", "county": "Los Angeles", "district": "Green Dot Public Schools", "email": "info@greendot.org", "domain": "www.greendot.org", "website": "https://www.greendot.org", "page_type": "internal"}
{"url": "https://www.greendot.org/procurement/", "status_code": 200, "response_size": 161649, "title": "Procurement - Green Dot", "description": "Green Dot posts Requests for Proposals (RFP). You may review each RFP to understand the guidelines for each service or system requested.", "text_content": "Enroll Now Donate English Español English Español About About Us Commitment to Equity Our Board Our Leadership Strategic Plan Schools Find a School Middle Schools High Schools 7-Year-Pathways Careers Career at Green Dot Teach at Green Dot Lead at Green Dot Credentials Teacher Credentials Clear Admin Credentials Central Office Support Support News Green Dot's Request for Proposals Request for Proposals Green Dot Public Schools frequently posts Requests for Proposals (RFP). You may review each RFP to understand the guidelines for each service or system that is requested.If you have questions, please e-mail the contact person listed in the RFP. Open Requests Archive Green Dot Public Schools Request For Proposal: Network Detection And Response (NDR) Cybersecurity Solution Bid Due Date: Thursday, July 31, 2025, at 12:00 PM, PSTRFP#: FY25-CS01View ApplicationRequest for Clarification –Questions and Answers Green Dot Public Schools California School Bus Transportation Services Bid Due Date: Friday, May 16, 2025, at 5:00 PM, PSTRFP#: FY26-002View ApplicationView Transportation Q&A Green Dot Public Schools California expanded learning programs at Ánimo James B. Taylor Charter Middle School and Ánimo Mae Jemison Charter Middle School Bid Due Date: Sunday June 30, 2024, at 5:00 PM, PTRFP#: ELP ASES FY25-027View Application Green Dot Public Schools CA FOOD SERVICE PROGRAM Bid Due Date: Saturday, April 25, 2025 by 4:30 pm PSTRFP#: FY26-001View ApplicationView Site Walk Attendees ListView Food Service RFP Q&AView Green Dot Public Schools California Animo Inglewood Annex Tenant Improvement Bid Due Date:Monday, January 20, 2025, at 5:00 PM, PSTRFP#: FY25-009View Application Green Dot Public Schools - Network Electronics Bid Due Date: November 8th, 2024 at 12:00 PM, PSTRFP#: FY25-CA02View ApplicationView Questions & Answers Green Dot Public Schools HVAC System Replacement Proposal Date: Wednesday, October 16th, 2024 at 5:00 PM, PSTRFP#: FY25-008View Application Green Dot Public Schools California school HVAC preventative maintenance services Proposal Due: Friday, May 31, 2024, 5:00 p.m. PSTRFP#: FY25-004View ApplicationAddendum GREEN DOT PUBLIC SCHOOLS CALIFORNIA TENANT IMPROVEMENT RFP#:FY25-006View ApplicationAddendum GREEN DOT PUBLIC SCHOOLS CALIFORNIA HVAC SYSTEM REPLACEMENT Proposal Due:Friday, May 31, 2024, at 5:00 PM, PSTRFP#:FY25-005View Application GREEN DOT PUBLIC SCHOOLS CALIFORNIA SPECIAL EDUCATION INSTRUCTIONAL & RELATED SERVICES Proposal Due: Friday, May 17, 2024, 5:00 p.m. PSTRFP#: FY25-001View ApplicationAddendum GREEN DOT PUBLIC SCHOOLS CALIFORNIA SCHOOL PROFESSIONAL SECURITY SERVICES Proposal Due:Friday, May 10, 2024, at 5:00 PM, PSTRFP#:FY25-003View ApplicationAddendum GREEN DOT PUBLIC SCHOOLS CALIFORNIA SCHOOL JANITORIAL SERVICES Proposal Due: Friday, May 3, 2024, at 5:00 PM, PSTRFP#: FY25-002View ApplicationAddendum Green Dot Public Schools California Workday Migration and Implementation Services Proposal Due: Tuesday, September 26, 2023, at 5:00 PM, PSTRFP#: 1001View Application Green Dot Public Schools California HVAC Upgrades Proposal Due: Friday, September 22, 2023, at 5:00 PM, PSTRFP#:FY24-003View Application Green Dot Public Schools California Employee Benefits Insurance Broker & Consulting Services Proposal Due: Wednesday, June 21, 2023, at 4 PM PSTRFP#: FY24-002View ApplicationAddendum to Green Dot Public Schools California Employee Benefits Insurance Broker & Consulting Services Green Dot Public Schools California Expanded Learning Programs at Ánimo Compton Charter School, Ánimo Ellen Ochoa Charter Middle School, and Ánimo Jefferson Charter Middle School Proposal Due: Friday June 30, 2023, at 4:00 PM PSTRFP#: ELP ASES FY23-026View Application RFP - Green Dot Public Schools California School Kitchen Equipment Proposal Due: Friday, January 20, 2023 at 5:00 P.M. PSTRFP#: FY22 SNP‐0007 RFP - Telecommunications and Wide Are Network (WAN) Connectivity Proposal Due: Thursday, January 12, 2023 at 11:00 A.M. PSTRFP#: 2023-CA01View ApplicationAttachment F RFP - Expanded Learning Program at Animo Venice Proposals Due: Wednesday August 31, 2022, at 5:00 PM, PTView Application RFP - Expanded Learning Program at Animo Leadership Proposals Due: Wednesday August 31, 2022, at 5:00 PM, PTView Application RFP - CalSHAPE HVAC Services at Green Dot Public Schools California Proposals Due: September 02, 2022 at 5:00 PM, PTRFP#: FY23-006View Application Green Dot Public Schools California Staffing Services Proposal Due: Monday, May 15, 2023, at 5:00 PM PSTRFP#: FY24-001View ApplicationAddendum to Green Dot Public Schools California Staffing Services Facebook-f Instagram X-twitter Linkedin-in 1149 S. Hill St, Ste. 600 Los Angeles, CA 90015 (323) 565-1600 info@greendot.org . Enroll Now Careers Donate Quick Links Finance and Budget Board Meetings Student Policy Manual Employee Resources Procurement Compliance Immigration Resources About Us Our Students Our Teachers Our Board Terms and Conditions © 2025 Green Dot Public S", "links_found": 12, "scraped_at": "2025-10-02T16:19:33.819439", "cds_code": "123456789", "school_name": "Animo Inglewood Charter High", "county": "Los Angeles", "district": "Green Dot Public Schools", "email": "info@greendot.org", "domain": "www.greendot.org", "website": "https://www.greendot.org", "page_type": "internal"}
{"url": "https://www.caminonuevo.org", "status_code": 200, "response_size": 57510, "title": "Camino Nuevo Charter Academy", "description": "Camino Nuevo Charter Academy is a group of charter schools serving the Westlake/MacArthur Park area of Los Angeles - In 2003 Camino Nuevo Charter Academy was awarded the Rudy Bruner Award for Urban Excellence gold medal.", "text_content": "Skip to main content Camino Nuevo Charter Academy Main Menu Toggle Home About Us Mission, Goals, and History Celebrating Camino Nuevo's 25th Anniversary Senior Leadership Team Financials Transparency Resolution Documents Contact the Home Support Office Staff Request for Proposals ELOP Plans Schools Academic Calendars Burlington (TK-8) Kayne Siart (TK-8) Castellanos (TK-5) Eisner (6-8) Cisneros (TK-8) Dalzell Lance (9-12) Enroll Application Upcoming Events - Virtual and In-Person Academics Our Approach Transitional Kindergarten Dual Language Program Special Education The Jeri Weiss Mental Health Program Key Programming Community Community & Safety Resource Hub Families Alumni Partnerships CNCA Soccer Field Governance Board Agendas Board of Directors Board Policies Staff Links Careers Apply Now Avance Teacher Residency Referral Program Human Resources Donate Donate Now Corporate Support Other Ways to Give Media Press News and Announcements YouTube Channel Important Links Videos Facebook Instagram Linkedin Subscribe Español Board Agendas Search × The Priority Enrollment Application for the 2026-27 School Year is OPEN NOW Apply by January 26, 2025, to enter our lottery on February 6th. Any application received after January 26th will be added to our waitlist. Learn More Don't show again Camino Nuevo Charter Academy Home Enroll Careers Donate Our Story Welcome No two kids learn the same way, and every family and community deserves high quality public education. That’s why, in 1999, the leaders of the Pueblo Nuevo Education and Development Group together with residents from the MacArthur Park community created Camino Nuevo Charter Academy (CNCA), a school built on the belief that every student should have the chance to go to a great school that puts their needs first, regardless of zip code, income, or ability level. Today, six CNCA schools across seven campuses are educating 3,200 students from early childhood through high school and proving that all children can learn and achieve when held to high expectations, exposed to rigorous and relevant learning experiences, and given targeted intervention and support in a safe and welcoming environment. At Camino Nuevo, all high school seniors graduate meeting admissions requirements for the University of California and California State University systems. In 2021, 76 percent of them enrolled in postsecondary education after graduation. While only 11 percent of low-income students nationwide earn a bachelor’s degree, that rate is more than three times higher for Camino Nuevo graduates. We pride ourselves on preparing all of our students for success in school, in college, and in life. Our schools have won state and national awards for improving outcomes for all students. In 2015, Camino Nuevo earned the Bright Spot Award from the White House Initiative on Educational Excellence for Hispanics for closing achievement gaps between English learners and native English speakers. In 2018, the National Alliance for Public Charter Schools recognized our schools with a special induction into the Charter Schools Hall of Fame. Educational and economic inequities persist in our communities, but our resolve to reverse these disparities and change the trajectory of students' lives is stronger than ever. Join us in helping our students achieve their college and career dreams by becoming a mentor to our students, volunteering at our schools, or making an investment in our work. If you're a parent looking for a great school, apply today. We're free, public schools open to all students. We invite you to return to our website regularly and follow us on social media to learn more about our community. Thank you for visiting us. Read More News The Priority Enrollment Application for the 2026-27 School Year is OPEN NOW Apply by January 26, 2025, to enter our lottery on February 6th. Any application received after January 26th will be added to our waitlist. Read More Welcome Back, CNCA Familia! Welcome to the 2025–26 school year! This is a milestone year for Camino Nuevo as we celebrate 25 years of bridging classroom and community. Read More Class of 2025 - Senior Reflection Video Read More Celebrating Camino Nuevo's 25th Anniversary Camino Nuevo Charter Academy is celebrating its 25th Anniversary during the 2025–2026 school year! As we reflect on 25 years of bridging classroom and community, we're introducing a refreshed logo, a special anniversary edition, and unveiling \"Belonging\" as our newest anchor value. Read More Show All News Camino Nuevo Charter Academy 3435 W. Temple Street, Los Angeles, CA 90026 Ph: (213) 417-3400 Fax: (323) 663-3132 Facebook Instagram Linkedin Subscribe Harassment, Discrimination and Bullying Policy Non-Discrimination Statement Privacy Policy Powered by Edlio Edlio Login Schools Staff Directory Board", "links_found": 17, "scraped_at": "2025-10-02T16:19:35.969528", "cds_code": "234567890", "school_name": "Camino Nuevo Charter Academy", "county": "Los Angeles", "district": "Camino Nuevo Charter Academy", "email": "contact@caminonuevo.org", "domain": "www.caminonuevo.org", "website": "https://www.caminonuevo.org", "page_type": "home"}
{"url": "https://www.caminonuevo.org/", "status_code": 200, "response_size": 57510, "title": "Camino Nuevo Charter Academy", "description": "Camino Nuevo Charter Academy is a group of charter schools serving the Westlake/MacArthur Park area of Los Angeles - In 2003 Camino Nuevo Charter Academy was awarded the Rudy Bruner Award for Urban Excellence gold medal.", "text_content": "Skip to main content Camino Nuevo Charter Academy Main Menu Toggle Home About Us Mission, Goals, and History Celebrating Camino Nuevo's 25th Anniversary Senior Leadership Team Financials Transparency Resolution Documents Contact the Home Support Office Staff Request for Proposals ELOP Plans Schools Academic Calendars Burlington (TK-8) Kayne Siart (TK-8) Castellanos (TK-5) Eisner (6-8) Cisneros (TK-8) Dalzell Lance (9-12) Enroll Application Upcoming Events - Virtual and In-Person Academics Our Approach Transitional Kindergarten Dual Language Program Special Education The Jeri Weiss Mental Health Program Key Programming Community Community & Safety Resource Hub Families Alumni Partnerships CNCA Soccer Field Governance Board Agendas Board of Directors Board Policies Staff Links Careers Apply Now Avance Teacher Residency Referral Program Human Resources Donate Donate Now Corporate Support Other Ways to Give Media Press News and Announcements YouTube Channel Important Links Videos Facebook Instagram Linkedin Subscribe Español Board Agendas Search × The Priority Enrollment Application for the 2026-27 School Year is OPEN NOW Apply by January 26, 2025, to enter our lottery on February 6th. Any application received after January 26th will be added to our waitlist. Learn More Don't show again Camino Nuevo Charter Academy Home Enroll Careers Donate Our Story Welcome No two kids learn the same way, and every family and community deserves high quality public education. That’s why, in 1999, the leaders of the Pueblo Nuevo Education and Development Group together with residents from the MacArthur Park community created Camino Nuevo Charter Academy (CNCA), a school built on the belief that every student should have the chance to go to a great school that puts their needs first, regardless of zip code, income, or ability level. Today, six CNCA schools across seven campuses are educating 3,200 students from early childhood through high school and proving that all children can learn and achieve when held to high expectations, exposed to rigorous and relevant learning experiences, and given targeted intervention and support in a safe and welcoming environment. At Camino Nuevo, all high school seniors graduate meeting admissions requirements for the University of California and California State University systems. In 2021, 76 percent of them enrolled in postsecondary education after graduation. While only 11 percent of low-income students nationwide earn a bachelor’s degree, that rate is more than three times higher for Camino Nuevo graduates. We pride ourselves on preparing all of our students for success in school, in college, and in life. Our schools have won state and national awards for improving outcomes for all students. In 2015, Camino Nuevo earned the Bright Spot Award from the White House Initiative on Educational Excellence for Hispanics for closing achievement gaps between English learners and native English speakers. In 2018, the National Alliance for Public Charter Schools recognized our schools with a special induction into the Charter Schools Hall of Fame. Educational and economic inequities persist in our communities, but our resolve to reverse these disparities and change the trajectory of students' lives is stronger than ever. Join us in helping our students achieve their college and career dreams by becoming a mentor to our students, volunteering at our schools, or making an investment in our work. If you're a parent looking for a great school, apply today. We're free, public schools open to all students. We invite you to return to our website regularly and follow us on social media to learn more about our community. Thank you for visiting us. Read More News The Priority Enrollment Application for the 2026-27 School Year is OPEN NOW Apply by January 26, 2025, to enter our lottery on February 6th. Any application received after January 26th will be added to our waitlist. Read More Welcome Back, CNCA Familia! Welcome to the 2025–26 school year! This is a milestone year for Camino Nuevo as we celebrate 25 years of bridging classroom and community. Read More Class of 2025 - Senior Reflection Video Read More Celebrating Camino Nuevo's 25th Anniversary Camino Nuevo Charter Academy is celebrating its 25th Anniversary during the 2025–2026 school year! As we reflect on 25 years of bridging classroom and community, we're introducing a refreshed logo, a special anniversary edition, and unveiling \"Belonging\" as our newest anchor value. Read More Show All News Camino Nuevo Charter Academy 3435 W. Temple Street, Los Angeles, CA 90026 Ph: (213) 417-3400 Fax: (323) 663-3132 Facebook Instagram Linkedin Subscribe Harassment, Discrimination and Bullying Policy Non-Discrimination Statement Privacy Policy Powered by Edlio Edlio Login Schools Staff Directory Board", "links_found": 16, "scraped_at": "2025-10-02T16:19:36.085836", "cds_code": "234567890", "school_name": "Camino Nuevo Charter Academy", "county": "Los Angeles", "district": "Camino Nuevo Charter Academy", "email": "contact@caminonuevo.org", "domain": "www.caminonuevo.org", "website": "https://www.caminonuevo.org", "page_type": "internal"}
{"url": "https://www.caminonuevo.org/apps/video/", "status_code": 200, "response_size": 59140, "title": "Video Gallery | Camino Nuevo Charter Academy", "description": "Camino Nuevo Charter Academy is a group of charter schools serving the Westlake/MacArthur Park area of Los Angeles - In 2003 Camino Nuevo Charter Academy was awarded the Rudy Bruner Award for Urban Excellence gold medal.", "text_content": "Skip to main content Camino Nuevo Charter Academy Main Menu Toggle Home About Us Mission, Goals, and History Celebrating Camino Nuevo's 25th Anniversary Senior Leadership Team Financials Transparency Resolution Documents Contact the Home Support Office Staff Request for Proposals ELOP Plans Schools Academic Calendars Burlington (TK-8) Kayne Siart (TK-8) Castellanos (TK-5) Eisner (6-8) Cisneros (TK-8) Dalzell Lance (9-12) Enroll Application Upcoming Events - Virtual and In-Person Academics Our Approach Transitional Kindergarten Dual Language Program Special Education The Jeri Weiss Mental Health Program Key Programming Community Community & Safety Resource Hub Families Alumni Partnerships CNCA Soccer Field Governance Board Agendas Board of Directors Board Policies Staff Links Careers Apply Now Avance Teacher Residency Referral Program Human Resources Donate Donate Now Corporate Support Other Ways to Give Media Press News and Announcements YouTube Channel Important Links Videos Facebook Instagram Linkedin Subscribe Español Board Agendas Search Curvy white dashed line on a dark green background. Video Gallery Please enable Javascript when viewing video pages. Expand player NIKE x CNCA x TPL Added Oct 26, 2023 Loading... More featured videos See all Loading next pane NIKE x CNCA x TPL Uploaded Oct 26, 2023 The Camino Nuevo Community: Cultivating Safety, Resilience, and Belonging Uploaded Dec 22, 2021 Elementary School Video Tour Uploaded Jan 21, 2020 High School Video Tour Uploaded Nov 27, 2019 Join the Team: Teachers Change Lives Uploaded Jul 21, 2018 Families as Education Partners Uploaded Dec 08, 2016 ◄ ► Most Recent Videos Search Submit 1:27 NIKE x CNCA x TPL Featured Uploaded Oct 26, 2023 1:50 The Camino Nuevo Community: Cultivating Safety, Resilience, and Belonging Featured Students and teachers celebrate in-person learning and community at Camino Nuevo Charter Academy. As we navigated the global COVID-19 pandemic, all CNCA schools reopened for in-person learning in the Fall of 2021. Our continued commitment: to keep everyone safe, honor everyone’s resilience, and ensure everyone in our community knows that they belong. Uploaded Dec 22, 2021 1:46 Elementary School Video Tour Featured At Camino Nuevo Charter Academy, we're approaching education differently. Learn more about our approach. Uploaded Jan 21, 2020 1:46 High School Video Tour Featured Join the next class of graduates at Camino Nuevo Charter Academy. Explore our high schools and apply today. Uploaded Nov 27, 2019 2:58 Join the Team: Teachers Change Lives Featured Meet Jenny and Kevin and the teachers who changed their lives. Uploaded Jul 21, 2018 2:53 Families as Education Partners Featured A look at how Camino Nuevo Charter Academy invests in making the college dream a reality for students and their families. Uploaded Dec 08, 2016 See all Camino Nuevo Charter Academy 3435 W. Temple Street, Los Angeles, CA 90026 Ph: (213) 417-3400 Fax: (323) 663-3132 Facebook Instagram Linkedin Subscribe Harassment, Discrimination and Bullying Policy Non-Discrimination Statement Privacy Policy Powered by Edlio Edlio Login Schools Staff Directory Board", "links_found": 13, "scraped_at": "2025-10-02T16:19:37.349082", "cds_code": "234567890", "school_name": "Camino Nuevo Charter Academy", "county": "Los Angeles", "district": "Camino Nuevo Charter Academy", "email": "contact@caminonuevo.org", "domain": "www.caminonuevo.org", "website": "https://www.caminonuevo.org", "page_type": "internal"}
{"url": "https://www.caminonuevo.org/apps/search/", "status_code": 200, "response_size": 41094, "title": "Search | Camino Nuevo Charter Academy", "description": "Camino Nuevo Charter Academy is a group of charter schools serving the Westlake/MacArthur Park area of Los Angeles - In 2003 Camino Nuevo Charter Academy was awarded the Rudy Bruner Award for Urban Excellence gold medal.", "text_content": "Skip to main content Camino Nuevo Charter Academy Main Menu Toggle Home About Us Mission, Goals, and History Celebrating Camino Nuevo's 25th Anniversary Senior Leadership Team Financials Transparency Resolution Documents Contact the Home Support Office Staff Request for Proposals ELOP Plans Schools Academic Calendars Burlington (TK-8) Kayne Siart (TK-8) Castellanos (TK-5) Eisner (6-8) Cisneros (TK-8) Dalzell Lance (9-12) Enroll Application Upcoming Events - Virtual and In-Person Academics Our Approach Transitional Kindergarten Dual Language Program Special Education The Jeri Weiss Mental Health Program Key Programming Community Community & Safety Resource Hub Families Alumni Partnerships CNCA Soccer Field Governance Board Agendas Board of Directors Board Policies Staff Links Careers Apply Now Avance Teacher Residency Referral Program Human Resources Donate Donate Now Corporate Support Other Ways to Give Media Press News and Announcements YouTube Channel Important Links Videos Facebook Instagram Linkedin Subscribe Español Board Agendas Search Curvy white dashed line on a dark green background. Search Search Clear Results ? results Camino Nuevo Charter Academy 3435 W. Temple Street, Los Angeles, CA 90026 Ph: (213) 417-3400 Fax: (323) 663-3132 Facebook Instagram Linkedin Subscribe Harassment, Discrimination and Bullying Policy Non-Discrimination Statement Privacy Policy Powered by Edlio Edlio Login Schools Staff Directory Board", "links_found": 11, "scraped_at": "2025-10-02T16:19:38.526924", "cds_code": "234567890", "school_name": "Camino Nuevo Charter Academy", "county": "Los Angeles", "district": "Camino Nuevo Charter Academy", "email": "contact@caminonuevo.org", "domain": "www.caminonuevo.org", "website": "https://www.caminonuevo.org", "page_type": "internal"}
{"url": "https://www.caminonuevo.org/apps/pages/nondiscrimination", "status_code": 200, "response_size": 47337, "title": "Non Discrimination Statement", "description": "Camino Nuevo Charter Academy is a group of charter schools serving the Westlake/MacArthur Park area of Los Angeles - In 2003 Camino Nuevo Charter Academy was awarded the Rudy Bruner Award for Urban Excellence gold medal.", "text_content": "Skip to main content Camino Nuevo Charter Academy Main Menu Toggle Home About Us Mission, Goals, and History Celebrating Camino Nuevo's 25th Anniversary Senior Leadership Team Financials Transparency Resolution Documents Contact the Home Support Office Staff Request for Proposals ELOP Plans Schools Academic Calendars Burlington (TK-8) Kayne Siart (TK-8) Castellanos (TK-5) Eisner (6-8) Cisneros (TK-8) Dalzell Lance (9-12) Enroll Application Upcoming Events - Virtual and In-Person Academics Our Approach Transitional Kindergarten Dual Language Program Special Education The Jeri Weiss Mental Health Program Key Programming Community Community & Safety Resource Hub Families Alumni Partnerships CNCA Soccer Field Governance Board Agendas Board of Directors Board Policies Staff Links Careers Apply Now Avance Teacher Residency Referral Program Human Resources Donate Donate Now Corporate Support Other Ways to Give Media Press News and Announcements YouTube Channel Important Links Videos Facebook Instagram Linkedin Subscribe Español Board Agendas Search Curvy white dashed line on a dark green background. Non-Discrimination Statement Camino Nuevo Charter Academy (CNCA) prohibits discrimination, harassment, intimidation and bullying in educational programs, activities, or employment on the basis of actual or perceived ancestry, age, color, disability, gender, gender identity, gender expression, nationality, race or ethnicity, religion, sex, sexual orientation, parental, pregnancy, family or marital status, military status, immigration status or association with a person or a group with one or more of these actual or perceived characteristics. Camino Nuevo Charter Academy requires that school personnel take immediate steps to intervene when safe to do so when he or she witnesses an act of discrimination, harassment, intimidation, or bullying.Questions or complaints of alleged discrimination, harassment, intimidation and bullying, equity or Title IX equity and compliance concerns should be directed to: Margarita Domingo Vice President of Human Resources 3435 W Temple St. Los Angeles, CA 90026 Phone: (213) 417-3410 To file a formal complaint, download and complete the form that appears on the right. Return the form to Margarita Domingo at the address listed above. DECLARACION DE NO DISCRIMINACION Camino Nuevo Charter Academy prohíbe la discriminación, el acoso, la intimidación y el acoso de cualquier estudiante en base a su raza o etnia, color, origen, religión, estado civil o parental, discapacidad física o mental, sexo, orientación sexual, género, identidad de género, expresión de género o la percepción de una o más de esas características, estado de inmigracion; o asociación con una persona o grupo con una o más de estas características reales o percibidas. CNCA requiere que el personal escolar tome medidas inmediatas para intervenir cuando sea seguro hacerlo y cuando él o ella sea testigo de un acto de discriminación, hostigamiento, o intimidación. El siguiente puesto es el coordinador designado para manejar quejas relacionadas con discriminación, acoso, o intimidación, y para responder preguntas sobre la póliza de no discriminación de CNCA: Sra. Margarita Domingo Vice Presidenta de Recursos Humanos 3435 W. Temple Street, Los Angeles, CA 90026 (213) 417-3410 Para presentar una queja formal, descargue y complete el formulario que aparece en la derecha. Devuelva el formulario a Margarita Domingo a la dirección indicada arriba. CNCA Formal Complaint Form CNCA Forma formal de queja Access the CDE's Title IX Page here: https://www.cde.ca.gov/re/di/eo/ Access the list of California organizations providing support to the youth and their families in Los Angeles here: https://www.cde.ca.gov/re/di/eo/region11.asp Camino Nuevo Charter Academy 3435 W. Temple Street, Los Angeles, CA 90026 Ph: (213) 417-3400 Fax: (323) 663-3132 Facebook Instagram Linkedin Subscribe Harassment, Discrimination and Bullying Policy Non-Discrimination Statement Privacy Policy Powered by Edlio Edlio Login Schools Staff Directory Board", "links_found": 11, "scraped_at": "2025-10-02T16:19:39.719429", "cds_code": "234567890", "school_name": "Camino Nuevo Charter Academy", "county": "Los Angeles", "district": "Camino Nuevo Charter Academy", "email": "contact@caminonuevo.org", "domain": "www.caminonuevo.org", "website": "https://www.caminonuevo.org", "page_type": "internal"}
