{"cds_code": "123456789", "school_name": "Animo Inglewood Charter High", "county": "Los Angeles", "district": "Green Dot Public Schools", "email": "info@greendot.org", "domain": "www.greendot.org", "url": "https://www.greendot.org", "status_code": 200, "response_size": 240613, "scraped_at": "2025-10-02T16:16:21.306303", "title": "Home - Green Dot", "description": "Green Dot Public Schools is a public charter school organization with 18 schools serving 10,000 students in grades 6-12 across Los Angeles.", "text_content": "Enroll Now Donate English Español English Español About About Us Commitment to Equity Our Board Our Leadership Strategic Plan Schools Find a School Middle Schools High Schools 7-Year-Pathways Careers Career at Green Dot Teach at Green Dot Lead at Green Dot Credentials Teacher Credentials Clear Admin Credentials Central Office Support Support News Enroll Enroll With Us Careers Work With Us Donate Support Us 25 Years of Transforming Public Education For 25 years, Green Dot Public Schools has been a driving force in reimagining what public education can be—anchored in the belief that every student deserves access to a high-quality education and a future filled with possibility. From our first school to the thriving network we are today, we’ve remained committed to ensuring that all students—regardless of background or zip code—graduate ready for college, leadership, and life. Through innovative teaching, personalized learning, and unwavering belief in our students’ potential, we’ve helped shape a generation of changemakers.As we celebrate this milestone, we invite you to reflect on our journey, honor the communities that fuel our mission, and imagine what the next 25 years can bring. Celebrate 25 Years With Us 25 Years Of Impact Free Public Charter Schools: Grades 6-12 Green Dot Public Schools is a public charter school organization with 18 high-performing schools serving 10,000 students in grades 6-12 across Los Angeles. Our mission is to help transform public education, so all students graduate prepared for college, leadership, and life. Learn More Green Dot by the Numbers 10000 Over 10,000 scholars enrolled 18 Operating 18 schools 74 Our college-ready graduation rate is 22 percentage points higher than the state average 90 More than 90% of parents recommend Green Dot to a friend 92 92% of Green Dot’s class of 2023 received college acceptance letters Explore and Experience Our Green Dot Community of Schools Middle School Middle School High School Ánimo Compton Charter School Ánimo Ellen Ochoa Charter Middle School Ánimo Florence-Firestone Charter Middle School Ánimo James B. Taylor Charter Middle School Ánimo Jefferson Charter Middle School Ánimo Legacy Charter Middle School Ánimo Mae Jemison Charter Middle School Ánimo Compton Charter School Ánimo City of Champions Charter High School Ánimo Inglewood Charter High School Ánimo Jackie Robinson Charter High School Ánimo Leadership Charter High School Ánimo Pat Brown Charter High School Ánimo RalphBunche Charter High School Ánimo South Los Angeles Charter High School Ánimo Venice Charter High School Ánimo Watts Charter High School Alain Leroy Locke College Preparatory Academy Oscar De La Hoya Ánimo Charter High School I am looking for a In Radius: Km Category Sub-Categories Grade Loading... Number Of Shops: 0 PRINT × Store Direction GET DIRECTIONS × From: To: Km Miles GET DIRECTIONS Use my location to find the closest Service Provider near me × USE LOCATION Description × What’s Happening at Green Dot View All News Spoken Word: ‘Perfect or Problematic’ by Jay’Onna Moore Art: ‘The Victim’ by Brandon Linares Writing: ‘A Plea from the Future’ by Belinda Ramos Writing: ‘The Dangers of Technology’ by Abril Alvarez Spoken Word: ‘Scroll Swipe Click to Freedom’ by Esmeralda Benitez Art: ‘The Electronic Crucifixion’ by Kimberly Rojas View All News Events View All Events There is no Event View All Events Stay Connected Powered by Curator.io Honors, Awards, and Recognitions At Green Dot Public Schools, we’re committed to providing all students with a high-quality education that prepares them for success in college and beyond. Our schools have been recognized for academic growth and excellence by the California Department of Education, CORE Districts, and U.S. News & World Report. We’ve also been honored among California Distinguished Schools and CREDO. Join Our Newsletter Join our quartlery newsletter and we’ll keep you in the loop about all of our latest news, programs, and ways to get involved. Email Address: Sign Up Facebook-f Instagram X-twitter Linkedin-in 1149 S. Hill St, Ste. 600 Los Angeles, CA 90015 (323) 565-1600 info@greendot.org . Enroll Now Careers Donate Quick Links Finance and Budget Board Meetings Student Policy Manual Employee Resources Procurement Compliance Immigration Resources About Us Our Students Our Teachers Our Board Terms and Conditions © 2025 Green Dot Public Schools About About Us Commitment to Equity Our Board Our Leadership Strategic Plan Schools Find a School Middle Schools High Schools 7-Year-Pathways Careers Career at Green Dot Teach at Green Dot Lead at Green Dot Credentials Teacher Credentials Clear Admin Credentials Central Office Support Support News We are pleased to announce that all Green Dot campuses have reopened. Our teams have worked hard to ensure a safe and clean environment for your children. Masks will be available for students and staff who need them, but we ask that you send your student to school with a mask if you have ma", "clean_text": "School: Animo Inglewood Charter High, County: Los Angeles, District: Green Dot Public Schools, Title: Home - Green Dot, Description: Green Dot Public Schools is a public charter school organization with 18 schools serving 10,000 students in grades 6-12 across Los Angeles., Content: Enroll Now Donate English Español English Español About About Us Commitment to Equity Our Board Our Leadership Strategic Plan Schools Find a School Middle Schools High Schools 7-Year-Pathways Careers Career at Green Dot Teach at Green Dot Lead at Green Dot Credentials Teacher Credentials Clear Admin Credentials Central Office Support Support News Enroll Enroll With Us Careers Work With Us Donate Support Us 25 Years of Transforming Public Education For 25 years, Green Dot Public Schools has been a driving force in reimagining what public education can be—anchored in the belief that every student deserves access to a high-quality education and a future filled with possibility. From our first school to the thriving network we are today, we’ve remained committed to ensuring that all students—regardless of background or zip code—graduate ready for college, leadership, and life. Through innovative teaching, personalized learning, and unwavering belief in our students’ potential, we’ve helped shape a generation of changemakers.As we celebrate this milestone, we invite you to reflect on our journey, honor the communities that fuel our mission, and imagine what the next 25 years can bring. Celebrate 25 Years With Us 25 Years Of Impact Free Public Charter Schools: Grades 6-12 Green Dot Public Schools is a public charter school organization with 18 high-performing schools serving 10,000 students in grades 6-12 across Los Angeles. Our mission is to help transform public education, so all students graduate prepared for college, leadership, and life. Learn More Green Dot by the Numbers 10000 Over 10,000 scholars enrolled 18 Operating 18 schools 74 Our college-ready graduation rate is 22 percentage points higher than the state average 90 More than 90% of parents recommend Green Dot to a friend 92 92% of Green Dot’s class of 2023 received college acceptance letters Explore and Experience Our Green Dot Community of Schools Middle School Middle School High School Ánimo Compton Charte"}
{"cds_code": "234567890", "school_name": "Camino Nuevo Charter Academy", "county": "Los Angeles", "district": "Camino Nuevo Charter Academy", "email": "contact@caminonuevo.org", "domain": "www.caminonuevo.org", "url": "https://www.caminonuevo.org", "status_code": 200, "response_size": 57511, "scraped_at": "2025-10-02T16:16:22.694081", "title": "Camino Nuevo Charter Academy", "description": "Camino Nuevo Charter Academy is a group of charter schools serving the Westlake/MacArthur Park area of Los Angeles - In 2003 Camino Nuevo Charter Academy was awarded the Rudy Bruner Award for Urban Excellence gold medal.", "text_content": "Skip to main content Camino Nuevo Charter Academy Main Menu Toggle Home About Us Mission, Goals, and History Celebrating Camino Nuevo's 25th Anniversary Senior Leadership Team Financials Transparency Resolution Documents Contact the Home Support Office Staff Request for Proposals ELOP Plans Schools Academic Calendars Burlington (TK-8) Kayne Siart (TK-8) Castellanos (TK-5) Eisner (6-8) Cisneros (TK-8) Dalzell Lance (9-12) Enroll Application Upcoming Events - Virtual and In-Person Academics Our Approach Transitional Kindergarten Dual Language Program Special Education The Jeri Weiss Mental Health Program Key Programming Community Community & Safety Resource Hub Families Alumni Partnerships CNCA Soccer Field Governance Board Agendas Board of Directors Board Policies Staff Links Careers Apply Now Avance Teacher Residency Referral Program Human Resources Donate Donate Now Corporate Support Other Ways to Give Media Press News and Announcements YouTube Channel Important Links Videos Facebook Instagram Linkedin Subscribe Español Board Agendas Search × The Priority Enrollment Application for the 2026-27 School Year is OPEN NOW Apply by January 26, 2025, to enter our lottery on February 6th. Any application received after January 26th will be added to our waitlist. Learn More Don't show again Camino Nuevo Charter Academy Home Enroll Careers Donate Our Story Welcome No two kids learn the same way, and every family and community deserves high quality public education. That’s why, in 1999, the leaders of the Pueblo Nuevo Education and Development Group together with residents from the MacArthur Park community created Camino Nuevo Charter Academy (CNCA), a school built on the belief that every student should have the chance to go to a great school that puts their needs first, regardless of zip code, income, or ability level. Today, six CNCA schools across seven campuses are educating 3,200 students from early childhood through high school and proving that all children can learn and achieve when held to high expectations, exposed to rigorous and relevant learning experiences, and given targeted intervention and support in a safe and welcoming environment. At Camino Nuevo, all high school seniors graduate meeting admissions requirements for the University of California and California State University systems. In 2021, 76 percent of them enrolled in postsecondary education after graduation. While only 11 percent of low-income students nationwide earn a bachelor’s degree, that rate is more than three times higher for Camino Nuevo graduates. We pride ourselves on preparing all of our students for success in school, in college, and in life. Our schools have won state and national awards for improving outcomes for all students. In 2015, Camino Nuevo earned the Bright Spot Award from the White House Initiative on Educational Excellence for Hispanics for closing achievement gaps between English learners and native English speakers. In 2018, the National Alliance for Public Charter Schools recognized our schools with a special induction into the Charter Schools Hall of Fame. Educational and economic inequities persist in our communities, but our resolve to reverse these disparities and change the trajectory of students' lives is stronger than ever. Join us in helping our students achieve their college and career dreams by becoming a mentor to our students, volunteering at our schools, or making an investment in our work. If you're a parent looking for a great school, apply today. We're free, public schools open to all students. We invite you to return to our website regularly and follow us on social media to learn more about our community. Thank you for visiting us. Read More News The Priority Enrollment Application for the 2026-27 School Year is OPEN NOW Apply by January 26, 2025, to enter our lottery on February 6th. Any application received after January 26th will be added to our waitlist. Read More Welcome Back, CNCA Familia! Welcome to the 2025–26 school year! This is a milestone year for Camino Nuevo as we celebrate 25 years of bridging classroom and community. Read More Class of 2025 - Senior Reflection Video Read More Celebrating Camino Nuevo's 25th Anniversary Camino Nuevo Charter Academy is celebrating its 25th Anniversary during the 2025–2026 school year! As we reflect on 25 years of bridging classroom and community, we're introducing a refreshed logo, a special anniversary edition, and unveiling \"Belonging\" as our newest anchor value. Read More Show All News Camino Nuevo Charter Academy 3435 W. Temple Street, Los Angeles, CA 90026 Ph: (213) 417-3400 Fax: (323) 663-3132 Facebook Instagram Linkedin Subscribe Harassment, Discrimination and Bullying Policy Non-Discrimination Statement Privacy Policy Powered by Edlio Edlio Login Schools Staff Directory Board", "clean_text": "School: Camino Nuevo Charter Academy, County: Los Angeles, District: Camino Nuevo Charter Academy, Title: Camino Nuevo Charter Academy, Description: Camino Nuevo Charter Academy is a group of charter schools serving the Westlake/MacArthur Park area of Los Angeles - In 2003 Camino Nuevo Charter Academy was awarded the Rudy Bruner Award for Urban Excellence gold medal., Content: Skip to main content Camino Nuevo Charter Academy Main Menu Toggle Home About Us Mission, Goals, and History Celebrating Camino Nuevo's 25th Anniversary Senior Leadership Team Financials Transparency Resolution Documents Contact the Home Support Office Staff Request for Proposals ELOP Plans Schools Academic Calendars Burlington (TK-8) Kayne Siart (TK-8) Castellanos (TK-5) Eisner (6-8) Cisneros (TK-8) Dalzell Lance (9-12) Enroll Application Upcoming Events - Virtual and In-Person Academics Our Approach Transitional Kindergarten Dual Language Program Special Education The Jeri Weiss Mental Health Program Key Programming Community Community & Safety Resource Hub Families Alumni Partnerships CNCA Soccer Field Governance Board Agendas Board of Directors Board Policies Staff Links Careers Apply Now Avance Teacher Residency Referral Program Human Resources Donate Donate Now Corporate Support Other Ways to Give Media Press News and Announcements YouTube Channel Important Links Videos Facebook Instagram Linkedin Subscribe Español Board Agendas Search × The Priority Enrollment Application for the 2026-27 School Year is OPEN NOW Apply by January 26, 2025, to enter our lottery on February 6th. Any application received after January 26th will be added to our waitlist. Learn More Don't show again Camino Nuevo Charter Academy Home Enroll Careers Donate Our Story Welcome No two kids learn the same way, and every family and community deserves high quality public education. That’s why, in 1999, the leaders of the Pueblo Nuevo Education and Development Group together with residents from the MacArthur Park community created Camino Nuevo Charter Academy (CNCA), a school built on the belief that every student should have the chance to go to a great school that puts their needs first, regardless of zip code, income, or ability level. Today, six CNCA schools across seven campuses are educating 3,200 students from early childhood through high school and proving that all children can learn a"}
{"cds_code": "345678901", "school_name": "Granada Hills Charter", "county": "Los Angeles", "district": "Granada Hills Charter", "email": "info@ghctk12.com", "domain": "www.ghctk12.com", "url": "https://www.ghctk12.com", "status_code": 200, "response_size": 81464, "scraped_at": "2025-10-02T16:16:23.880229", "title": "Home - Granada Hills Charter School", "description": "Home - Granada Hills Charter School is an independent public school in Los Angeles, CA known for its students' high academic achievement.", "text_content": "SearchClearSearch AboutAccreditationAccountability & ComplianceBoard of Directors & CommitteesEmploymentLCAPMission & VisionStaff DirectoryAdmissionsAnnual RegistrationAttendanceCampus ToursEnrollment ApplicationsInquireKnow Your Educational RightsProgramsGrades TK-8Academic ProgramsPrimary Years ProgrammeMiddle Years ProgrammeiGranadaAttendanceBell ScheduleCalendarClubs & ActivitiesCounselingFood ServicesIntramural SportsStaff DirectoryGrades 9-12Curriculum & InstructionGlobal Business & FinanceGranada Guaranteed CurriculumiGranada Independent StudyInternational Baccalaureate (IB)New Media AcademyScience, Technology, Engineering, Mathematics (STEM)Activities & AthleticsAttendanceCalendarCollege & CareerCounselingContact UsTutoring & EnrichmentWellness CenterCourse CatalogDeans' OfficeFood ServicesHealth OfficeStaff DirectoryiGranadaAdmissions PolicyMeet Our AdvisorsCounselingSeminar Schedules(opens in new window/tab)Student LifeInterest FormAthletics ProgramSpecial Programs (TK-12)ResourcesBell SchedulesAcademic CalendarCommunicationsDonateAlumniFoundation(opens in new window/tab)Matching GiftsPartnershipsDonate Now(opens in new window/tab)Food ServicesPolicies & FormsPTSAStudent StoreStudent Support ServicesActivities and AthleticsAttendanceCollege and CareerCounselingDeans' OfficeHealth OfficeImmigration ResourcesTK-8 CounselingWellness CenterTip LineNews Grades TK-8Grades 9-12GHCCanvasEmail(opens in new window/tab)HACMinga(opens in new window/tab)Staff PortalToddle(opens in new window/tab) Skip to Main Content Grades TK-8Grades 9-12GHCCanvasEmail(opens in new window/tab)HACMinga(opens in new window/tab)Staff PortalToddle(opens in new window/tab) AboutAccreditationAccountability & ComplianceBoard of Directors & CommitteesEmploymentLCAPMission & VisionStaff DirectoryAdmissionsAnnual RegistrationAttendanceCampus ToursEnrollment ApplicationsInquireKnow Your Educational RightsProgramsGrades TK-8Grades 9-12iGranadaAthletics ProgramSpecial Programs (TK-12)ResourcesBell SchedulesAcademic CalendarCommunicationsDonateFood ServicesPolicies & FormsPTSAStudent StoreStudent Support ServicesTip LineNews Search SearchClearSearch Home Home pauseplay ExploreGHC Preparing students for a 21st-century workforce and life. We create student-centered environments to develop academic curiosity, practical skills, and positive attitudes that enable successful, lifelong learners and responsible global citizens. × Devonshire Campus The TK-8 program at Granada Hills Charter (GHC) offers a warm and stimulating primary school environment for children 4 to 10 years old. An International Baccalaureate (IB) World School, students learn the importance of being life-long learners and productive, responsible global citizens encouraged to take risks, learn from failure, and meet their goals. We look forward to welcoming you on campus to start your journey at GHC. × Link × Zelzah Campus The high school program at Granada Hills Charter (GHC) is consistently ranked as one of the best schools in California. Students are challenged as individuals and as leaders and will graduate a different person than when they entered high school. Whether it’s the collaborative experience of our academic teams or the bonds forged in myriad clubs and athletics, GHC prepares students for a 21st-century workforce and life. × Link × iGranada The iGranada program at Granada Hills Charter (GHC) offers students rigorous curricular advancements and course structure beyond the traditional offerings of an online school. Since iGranada is a program within GHC, students receive hybrid opportunities to access in-person clubs, activities and athletics, and health and wellness resources (registered nurses, social workers, and school psychologists). Students can design their academic journey in ways that work for them, whether a highly flexible non-traditional schedule or one that more closely aligns with a traditional school schedule. × Link × GHC Highlights Granada Hills Charter (GHC) proudly celebrates our students' successes. The consistency in which GHC is ranked as a top school in California is due to the talent and leadership of our faculty and staff. Read the school blog from our Executive Director, view student and staff highlights, and subscribe to important updates for all your favorite events. Read our blog View all news View all events × Announcement GHC's Enrollment Lottery Application Window Is Now Open Admissions & Enrollment GHC's Eighth Grade Open House is October 11 at 10:00 a.m. (opens in new window/tab) Parent Workshops Parent Workshop: Behind the Cyber Curtain (opens in new window/tab) Our Stories Granada Hills Charter (GHC) values the entire family experience, which is why we regularly survey parents to let us know if they're happy, where we could improve, and share recommendations. Here's what our community, both past and present, has to say about our school. × Avantika V.Alumni, iGranada Program I absolutely loved my time at Granada Hills Charter! The ", "clean_text": "School: Granada Hills Charter, County: Los Angeles, District: Granada Hills Charter, Title: Home - Granada Hills Charter School, Description: Home - Granada Hills Charter School is an independent public school in Los Angeles, CA known for its students' high academic achievement., Content: SearchClearSearch AboutAccreditationAccountability & ComplianceBoard of Directors & CommitteesEmploymentLCAPMission & VisionStaff DirectoryAdmissionsAnnual RegistrationAttendanceCampus ToursEnrollment ApplicationsInquireKnow Your Educational RightsProgramsGrades TK-8Academic ProgramsPrimary Years ProgrammeMiddle Years ProgrammeiGranadaAttendanceBell ScheduleCalendarClubs & ActivitiesCounselingFood ServicesIntramural SportsStaff DirectoryGrades 9-12Curriculum & InstructionGlobal Business & FinanceGranada Guaranteed CurriculumiGranada Independent StudyInternational Baccalaureate (IB)New Media AcademyScience, Technology, Engineering, Mathematics (STEM)Activities & AthleticsAttendanceCalendarCollege & CareerCounselingContact UsTutoring & EnrichmentWellness CenterCourse CatalogDeans' OfficeFood ServicesHealth OfficeStaff DirectoryiGranadaAdmissions PolicyMeet Our AdvisorsCounselingSeminar Schedules(opens in new window/tab)Student LifeInterest FormAthletics ProgramSpecial Programs (TK-12)ResourcesBell SchedulesAcademic CalendarCommunicationsDonateAlumniFoundation(opens in new window/tab)Matching GiftsPartnershipsDonate Now(opens in new window/tab)Food ServicesPolicies & FormsPTSAStudent StoreStudent Support ServicesActivities and AthleticsAttendanceCollege and CareerCounselingDeans' OfficeHealth OfficeImmigration ResourcesTK-8 CounselingWellness CenterTip LineNews Grades TK-8Grades 9-12GHCCanvasEmail(opens in new window/tab)HACMinga(opens in new window/tab)Staff PortalToddle(opens in new window/tab) Skip to Main Content Grades TK-8Grades 9-12GHCCanvasEmail(opens in new window/tab)HACMinga(opens in new window/tab)Staff PortalToddle(opens in new window/tab) AboutAccreditationAccountability & ComplianceBoard of Directors & CommitteesEmploymentLCAPMission & VisionStaff DirectoryAdmissionsAnnual RegistrationAttendanceCampus ToursEnrollment ApplicationsInquireKnow Your Educational RightsProgramsGrades TK-8Grades 9-12iGranadaAthletics ProgramSpecial Programs (TK-12)ResourcesBell"}
