{
  "metadata": {
    "analyzed_at": "2025-10-02T16:39:18.005680",
    "model_used": "llama3.2:3b",
    "total_schools": 2,
    "successful_analyses": 2,
    "failed_analyses": 0,
    "success_rate": 100.0
  },
  "schools": {
    "234567890_Camino_Nuevo_Charter_Academy": {
      "file": "234567890_Camino_Nuevo_Charter_Academy.json",
      "school_info": {
        "cds_code": "234567890",
        "school_name": "Camino Nuevo Charter Academy",
        "county": "Los Angeles",
        "district": "Camino Nuevo Charter Academy",
        "email": "contact@caminonuevo.org",
        "domain": "www.caminonuevo.org",
        "website": "https://www.caminonuevo.org"
      },
      "analysis_result": {
        "success": true,
        "analysis": "Here is a brief analysis of Camino Nuevo Charter Academy:\n\n- Mission: To provide high-quality public education that celebrates diversity and promotes academic excellence, while fostering a sense of community and social responsibility.\n\n- Programs: Key programs include Transitional Kindergarten, Dual Language Program, Special Education, Jeri Weiss Mental Health Program, and Avance Teacher Residency. The school also offers various extracurricular activities, such as soccer.\n\n- Contact: Email: [not specified], Phone: [not specified]\n\n- Unique Features: Camino Nuevo Charter Academy is a 25-year-old charter school that prides itself on its diverse student body, community-focused approach, and commitment to social-emotional learning. The school's dual language program and special education services are notable highlights.\n\n- Enrollment: To enroll, families can apply through the Priority Enrollment Application for the 2026-27 school year, which is open now until January 26, 2025. Applications received after this date will be added to a waitlist.",
        "model_used": "llama3.2:3b",
        "school_name": "Camino Nuevo Charter Academy"
      }
    },
    "123456789_Animo_Inglewood_Charter_High": {
      "file": "123456789_Animo_Inglewood_Charter_High.json",
      "school_info": {
        "cds_code": "123456789",
        "school_name": "Animo Inglewood Charter High",
        "county": "Los Angeles",
        "district": "Green Dot Public Schools",
        "email": "info@greendot.org",
        "domain": "www.greendot.org",
        "website": "https://www.greendot.org"
      },
      "analysis_result": {
        "success": true,
        "analysis": "Here is a brief analysis of Animo Inglewood Charter High:\n\n- Mission: To provide high-quality education to all students, regardless of background or zip code, with the goal of helping them graduate ready for college, leadership, and life.\n\n- Programs: The school focuses on innovative teaching, personalized learning, and 7-Year-Pathways, which aims to prepare students for post-secondary education and careers.\n\n- Contact: Website: https://www.greendot.org; Email not specified.\n\n- Unique Features: Animo Inglewood Charter High is part of the Green Dot Public Schools network, a public charter school organization with 18 high-performing schools serving 10,000 students in grades 6-12 across Los Angeles. The school's commitment to equity and its focus on personalized learning set it apart.\n\n- Enrollment: To enroll or apply, visit the website at https://www.greendot.org and click on \"Enroll Now\" or contact the school directly for more information.",
        "model_used": "llama3.2:3b",
        "school_name": "Animo Inglewood Charter High"
      }
    }
  }
}